renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type3/aws_ota_pal.c
    /* Set default return status to uninitialized. */
    OTA_Err_t eResult = kOTA_Err_Uninitialized;

    if( NULL != C )
    {
		memset((void *)&load_firmware_control_block, 0, sizeof(LOAD_FIRMWARE_CONTROL_BLOCK));
		load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;

		/* delete task/queue for flashing */
		vTaskDelete(xTask);
		vQueueDelete(xQueue);

		/* todo: リスト全消去 */

        OTA_LOG_L1( "[%s] OK\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_None;
    }
    else /* Context was not valid. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_FileAbort;
    }
    return eResult;
}
/*-----------------------------------------------------------*/

/* Write a block of data to the specified file. */
int16_t prvPAL_WriteBlock( OTA_FileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pacData,
                           uint32_t ulBlockSize )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_WriteBlock" );
    /* Set default return status to uninitialized. */
    OTA_Err_t eResult = kOTA_Err_Uninitialized;

    uint8_t arg1[32], arg2[32], arg3[32];
    uint8_t *current_index;
    uint8_t *next_index;
    uint8_t *assembled_packet_buffer;
    uint32_t assembled_packet_buffer_size = ulBlockSize;
    uint32_t address;
    uint8_t binary[ONE_COMMAND_BINARY_LENGH];
    uint32_t length;
    uint32_t head_fragmented_size = 0, tail_fragmented_size = 0;
    uint8_t pacData_string[(1 << otaconfigLOG2_FILE_BLOCK_SIZE) + 1]; /* +1 means string terminator 0 */
    uint8_t hash_sha1[HASH_SHA1_LENGTH];
    FLASH_BLOCK flash_block;
    static uint8_t flash_block_array[FLASH_CF_MIN_PGM_SIZE];

    FRAGMENTED_PACKET_LIST *previous_fragmented_packet, *next_fragmented_packet;
    uint32_t specified_packet_number = (ulOffset / (1 << otaconfigLOG2_FILE_BLOCK_SIZE));

    pacData_string[(1 << otaconfigLOG2_FILE_BLOCK_SIZE)] = 0;
    memcpy(pacData_string, pacData, ulBlockSize);
    pacData_string[ulBlockSize] = 0; /* string terminator */

	current_index = pacData_string;

	flash_block.binary = flash_block_array;

	/*----------- pre-process for fragmented line on head/tail of pacData ----------*/
	/* calculate assembled_packet_buffer size for head of pacData */
	previous_fragmented_packet = fragmented_packet_list_search(fragmented_packet_list_head, specified_packet_number - 1, FRAGMENTED_PACKET_TYPE_TAIL);
	if(previous_fragmented_packet != NULL)
	{
		assembled_packet_buffer_size += previous_fragmented_packet->content.length;
	}
	/* cutting off the fragment of head of pacData and add this into list */
	else
	{
		if(specified_packet_number != 0)
		{
			next_index = (uint8_t*)strstr((char*)current_index, "\n");
			next_index += 1; /* +1 means LF */
			head_fragmented_size = next_index - current_index;
			assembled_packet_buffer = pvPortMalloc(head_fragmented_size + 1); /* +1 means string terminator 0 */
			assembled_packet_buffer[head_fragmented_size] = 0;
			memcpy(assembled_packet_buffer, current_index, head_fragmented_size);
			fragmented_packet_list_head = fragmented_packet_list_add(fragmented_packet_list_head, specified_packet_number, FRAGMENTED_PACKET_TYPE_HEAD, assembled_packet_buffer, strlen((char *)assembled_packet_buffer));
			vPortFree(assembled_packet_buffer);
			assembled_packet_buffer_size -= head_fragmented_size;
			current_index = next_index;
		}
		/* no more fragment data before head of the pacData */
		else
		{
			/* nothing to do */
		}
	}
	/* calculate assembled_packet_buffer size for tail of pacData */
	next_fragmented_packet = fragmented_packet_list_search(fragmented_packet_list_head, specified_packet_number + 1, FRAGMENTED_PACKET_TYPE_HEAD);
	if(next_fragmented_packet != NULL)
	{
		assembled_packet_buffer_size += next_fragmented_packet->content.length;
	}
	/* cutting off the fragment of tail of pacData and add this into list */
	else
	{
		/* search last 1 line */
		while(1)
		{
			next_index = (uint8_t*)strstr((char*)current_index, "\n");
			if(next_index == NULL)
			{
				break;
			}
			next_index += 1; /* +1 means LF */
			current_index = next_index;
		}
		tail_fragmented_size = strlen((char *)current_index);
		assembled_packet_buffer = pvPortMalloc(tail_fragmented_size + 1); /* +1 means string terminator 0 */
		assembled_packet_buffer[tail_fragmented_size] = 0;
		memcpy(assembled_packet_buffer, current_index, tail_fragmented_size);
		fragmented_packet_list_head = fragmented_packet_list_add(fragmented_packet_list_head, specified_packet_number, FRAGMENTED_PACKET_TYPE_TAIL, assembled_packet_buffer, strlen((char *)assembled_packet_buffer));
		vPortFree(assembled_packet_buffer);
		assembled_packet_buffer_size -= tail_fragmented_size;
		pacData_string[ulBlockSize - tail_fragmented_size] = 0;
	}

	/* allocate the assembled_packet_buffer memory */
	assembled_packet_buffer = pvPortMalloc(assembled_packet_buffer_size + 1); /* +1 means string terminator 0 */
	assembled_packet_buffer[assembled_packet_buffer_size] = 0;
	assembled_packet_buffer[0] = 0;

	/* if previous fragment packet would be found, it is needed to be combined into head of pacData */
	if(previous_fragmented_packet != NULL)
	{
		strcat((char *)assembled_packet_buffer, (char *)previous_fragmented_packet->content.string);
		fragmented_packet_list_head = fragmented_packet_list_delete(fragmented_packet_list_head, specified_packet_number - 1, FRAGMENTED_PACKET_TYPE_TAIL);
	}
	strcat((char *)assembled_packet_buffer, (char *)&pacData_string[head_fragmented_size]);

	/* if next fragment packet would be found, it is needed to be combined into tail of pacData */
	if(next_fragmented_packet != NULL)
	{
		strcat((char *)assembled_packet_buffer, (char *)next_fragmented_packet->content.string);
		fragmented_packet_list_head = fragmented_packet_list_delete(fragmented_packet_list_head, specified_packet_number + 1, FRAGMENTED_PACKET_TYPE_HEAD);
	}
	/*----------- process each commands on assembled_packet_buffer ----------*/
    current_index = assembled_packet_buffer;
	next_index = (uint8_t*)strstr((char*)current_index, "\n");
	if(next_index != NULL)
	{
		next_index += 1; /* +1 means LF */
	    while(1)
	    {
	        /* extract 1 line*/
	    	sscanf((char*)current_index, "%32s %32s %32s", (char*)arg1, (char*)arg2, (char*)arg3);
			if(!strcmp((char*)arg1, "upprogram"))
			{
				sscanf((char *)arg2, "%x", &address);
				length = base64_decode(arg3, binary, strlen((char *)arg3));
				fragmented_flash_block_list_head = fragmented_flash_block_list_insert(fragmented_flash_block_list_head, address, binary, length);
			}
			else if(!strcmp((char*)arg1, "sha1"))
			{
				base64_decode(arg2, hash_sha1, strlen((char *)arg2));
				memcpy((void *)load_firmware_control_block.hash_sha1, hash_sha1, HASH_SHA1_LENGTH);
			}

