renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type3/aws_ota_pal.c
			next_index = (uint8_t*)strstr((char*)current_index, "\n");
			next_index += 1; /* +1 means LF */
			current_index = next_index;
			/* exit if no more command would be found */
			if(!strlen((char *)current_index))
			{
				eResult = kOTA_Err_None;
				break;
			}
	    }
	}
	else
	{
		OTA_LOG_L1("illegal data format [%s].\r\n", current_index);
		eResult = kOTA_Err_OutOfMemory;
    	/* todo: リスト全消去 */
	}
	/*----------- write (request to queue) flash phase ----------*/
	if(fragmented_flash_block_list_head != NULL)
	{
		while(1)
		{
			fragmented_flash_block_list_head = fragmented_flash_block_list_assemble(fragmented_flash_block_list_head, &flash_block);
			if(flash_block.address != NULL)
			{
				flash_block_for_queue.address = flash_block.address;
				memcpy(flash_block_for_queue.binary, flash_block.binary, sizeof(flash_block_for_queue.binary));
				if(xQueueSend(xQueue, &flash_block_for_queue, NULL) != pdPASS)
				{
					/* todo: リスト全消去 */
					OTA_LOG_L1("OTA flashing queue send error.\r\n");
					eResult = kOTA_Err_OutOfMemory;
				}
			}
			else
			{
				break;
			}
		}
	}
	/*----------- finalize phase ----------*/
	fragmented_packet_list_print(fragmented_packet_list_head);
	fragmented_flash_block_list_print(fragmented_flash_block_list_head);
	vPortFree(assembled_packet_buffer);
	return eResult;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_CloseFile( OTA_FileContext_t * const C )
{
	uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
	uint32_t required_dataflash_block_num;
	uint32_t flashing_timeout_counter = 0;

    DEFINE_OTA_METHOD_NAME( "prvPAL_CloseFile" );
    OTA_LOG_L1("[%s] is called.\r\n", OTA_METHOD_NAME);

    OTA_Err_t eResult = kOTA_Err_None;
    if( NULL != C )
    {
    	while(load_firmware_control_block.processed_byte != (FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))
    	{
    		vTaskDelay(1);
    		flashing_timeout_counter++;
    		if(flashing_timeout_counter == FLASHING_TIMEOUT)
    		{
    			break;
    		}
    	}
    	if(flashing_timeout_counter != FLASHING_TIMEOUT)
    	{
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE;
			R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
			if(!memcmp(hash_sha1, (void *)load_firmware_control_block.hash_sha1, SHA1_HASH_LENGTH_BYTE_SIZE))
			{
				/* confirm which hash(hash0/hash1 on dataflash) is same as current executed area hash */
				R_Sha1((uint8_t*)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);

				if(!memcmp(hash_sha1, firmware_update_control_block_image.data.hash0_sha1, SHA1_HASH_LENGTH_BYTE_SIZE))
				{
					/* hash0_sha1 is for current executed area mac, should write to hash1_sha1 */
					memcpy(firmware_update_control_block_image.data.hash1_sha1, (void *)load_firmware_control_block.hash_sha1, sizeof(firmware_update_control_block_image.data.hash1_sha1));
				}
				else
				{
					/* program_mac1 is for current executed area mac, should write to hash0_sha1 */
					memcpy(firmware_update_control_block_image.data.hash0_sha1, (void *)load_firmware_control_block.hash_sha1, sizeof(firmware_update_control_block_image.data.hash0_sha1));
				}
				firmware_update_control_block_image.data.lifecycle_state = LIFECYCLE_STATE_UPDATING;
				R_Sha1((uint8_t *)&firmware_update_control_block_image.data, hash_sha1, sizeof(firmware_update_control_block_image.data));
				memcpy(firmware_update_control_block_image.hash_sha1, hash_sha1, SHA1_HASH_LENGTH_BYTE_SIZE);
				required_dataflash_block_num = sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
				if(sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
				{
					required_dataflash_block_num++;
				}
				R_FLASH_Erase((flash_block_address_t)FLASH_DF_BLOCK_0, required_dataflash_block_num);
				load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_ERASE_DATA_FLASH;
				while(load_firmware_control_block.status != FIRMWARE_UPDATE_STATE_FINALIZE_COMPLETED)
				{
					vTaskDelay(1);
				}
			}

			memset((void *)&load_firmware_control_block, 0, sizeof(LOAD_FIRMWARE_CONTROL_BLOCK));
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_CLOSED;

			/* delete task/queue for flashing */
			vTaskDelete(xTask);
			vQueueDelete(xQueue);

			/* todo: リスト全消去 */

			OTA_LOG_L1( "[%s] OK\r\n", OTA_METHOD_NAME );
			eResult = kOTA_Err_None;
    	}
    	else
    	{
			OTA_LOG_L1( "[%s] NG, flashing not completed.\r\n", OTA_METHOD_NAME );
	        eResult = kOTA_Err_FileAbort;
    	}
    }
    else /* Context was not valid. */
    {
        OTA_LOG_L1( "[%s] ERROR - Invalid context.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_FileAbort;
    }
    return eResult;
}
/*-----------------------------------------------------------*/


static OTA_Err_t prvPAL_CheckFileSignature( OTA_FileContext_t * const C )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CheckFileSignature" );
    OTA_LOG_L1("[%s] is called.\r\n", OTA_METHOD_NAME);

    /* not implemented */
    return kOTA_Err_SignatureCheckFailed;
}
/*-----------------------------------------------------------*/

static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_ReadAndAssumeCertificate" );
    OTA_LOG_L1("[%s] is called.\r\n", OTA_METHOD_NAME);

    /* not implemented */
    return NULL;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_ResetDevice( void )
{
    DEFINE_OTA_METHOD_NAME("prvPAL_ResetDevice");

    OTA_LOG_L1( "[%s] Resetting the device.\r\n", OTA_METHOD_NAME );

    /* Software reset issued (Not bank swap) */
    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
    SYSTEM.SWRR = 0xa501;
	while(1);	/* software reset */

    /* We shouldn't actually get here if the board supports the auto reset.
     * But, it doesn't hurt anything if we do although someone will need to
     * reset the device for the new image to boot. */
    return kOTA_Err_None;
}
/*-----------------------------------------------------------*/

OTA_Err_t prvPAL_ActivateNewImage( void )
{
    DEFINE_OTA_METHOD_NAME("prvPAL_ActivateNewImage");

