renesas/amazon-freertos/lib/ota/portable/renesas/rx65n-rsk/type3/aws_ota_pal.c
	if(head != NULL)
	{
		while(1)
		{
			if(tmp->content.address == address)
			{
				break;
			}
			if(tmp->next == NULL)
			{
				tmp = NULL;
				break;
			}
			previous = tmp;
			tmp = tmp->next;
		}
		if(tmp != NULL)
		{
			/* delete target exists on not head, remove specified and return head in this case */
			if(previous != NULL)
			{
				previous->next = tmp->next;
				vPortFree(tmp->content.binary);
				vPortFree(tmp);
				tmp = head;
			}
			else
			{
				/* delete target exists on head with subsequent data, remove head and return specified (as new head) in this case */
				if(head->next != NULL)
				{
					tmp = head->next;
				}
				/* delete target exists on head without subsequent data, remove head and return NULL in this case */
				else
				{
					tmp = NULL;
				}
				vPortFree(head->content.binary);
				vPortFree(head);
			}
		}
	}
	return tmp;
}

static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_print(FRAGMENTED_FLASH_BLOCK_LIST *head)
{
	FRAGMENTED_FLASH_BLOCK_LIST *tmp = head;
	uint32_t total_heap_length, total_list_count;

	total_heap_length = 0;
	total_list_count = 0;

	if(head != NULL)
	{
		while(1){
			total_heap_length += sizeof(FRAGMENTED_FLASH_BLOCK_LIST);
			total_heap_length += tmp->content.length;
			total_list_count++;
			if(tmp->next == NULL)
			{
				break;
			}
			tmp = tmp->next;
		};
	}
    OTA_LOG_L2("FRAGMENTED_FLASH_BLOCK_LIST: total_heap_length = [%d], total_list_count = [%d].\r\n", total_heap_length, total_list_count);

	return tmp;
}

/***********************************************************************************************************************
* Function Name: fragmented_flash_block_list_assemble
* Description  : Assemble the fragmented flash block from the list
* Arguments    : head - current head of list
*                flash_block
*                  address - top of actual physical address of the flash_block, if this value would be NULL, no target flash data exists.
*                  binary - assembled flash_block[FLASH_CF_MIN_PGM_SIZE] from the list
*                  length - binary length
* Return Value : FRAGMENTED_PACKET_LIST* - new head of list (returns same value as specified head in normally,
*                                                            new head would be returned when head would be deleted.
*                                                            NULL would be returned when all list are deleted.)
***********************************************************************************************************************/
static FRAGMENTED_FLASH_BLOCK_LIST *fragmented_flash_block_list_assemble(FRAGMENTED_FLASH_BLOCK_LIST *head, FLASH_BLOCK *flash_block)
{
	FRAGMENTED_FLASH_BLOCK_LIST *tmp = head;
	FRAGMENTED_FLASH_BLOCK_LIST *flash_block_candidate[FLASH_CF_MIN_PGM_SIZE/ONE_COMMAND_BINARY_LENGH];
	uint32_t assembled_length = 0;
	uint32_t loop_counter = 0;

	/* search aligned FLASH_CF_MIN_PGM_SIZE top address */
	while(1)
	{
		if(!(tmp->content.address % FLASH_CF_MIN_PGM_SIZE))
		{
			/* extract continuous flash_block candidate */
			assembled_length = 0;
			loop_counter = 0;
			while(1)
			{
				if(loop_counter < ((FLASH_CF_MIN_PGM_SIZE / ONE_COMMAND_BINARY_LENGH) - 1))
				{
					if((tmp->content.address + tmp->content.length) == tmp->next->content.address)
					{
						assembled_length += tmp->content.length;
						flash_block_candidate[loop_counter] = tmp;
					}
					else
					{
						break;
					}
				}
				else if(loop_counter == (FLASH_CF_MIN_PGM_SIZE / ONE_COMMAND_BINARY_LENGH) - 1)
				{
					assembled_length += tmp->content.length;
					flash_block_candidate[loop_counter] = tmp;
				}
				else
				{
					break;
				}
				tmp = tmp->next;
				loop_counter++;
			}
		}

		/* break if found completed flash_block_candidate or found end of list */
		if((assembled_length == FLASH_CF_MIN_PGM_SIZE) || (tmp == NULL))
		{
			break;
		}
		/* search next candidate */
		else
		{
			tmp = tmp->next;
		}
	}

	/* assemble flash_block */
	if(assembled_length == FLASH_CF_MIN_PGM_SIZE)
	{
		tmp = head;
		/* remove flash_block from list */
		flash_block->address = flash_block_candidate[0]->content.address;
		flash_block->length = assembled_length;
		for(uint32_t i = 0; i < (FLASH_CF_MIN_PGM_SIZE/ONE_COMMAND_BINARY_LENGH); i++)
		{
			memcpy(&flash_block->binary[i * ONE_COMMAND_BINARY_LENGH], flash_block_candidate[i]->content.binary, flash_block_candidate[i]->content.length);
			tmp = fragmented_flash_block_list_delete(tmp, flash_block_candidate[i]->content.address);
		}
	}
	else
	{
		tmp = head;
		flash_block->address = NULL;
		flash_block->binary = NULL;
		flash_block->length = NULL;
	}
	return tmp;
}

uint32_t flash_write111 = 0;

static void ota_flashing_task(void)
{
	FLASH_BLOCK_FOR_QUEUE flash_block_for_queue;
	uint32_t flash_block_array[FLASH_CF_MIN_PGM_SIZE];
	uint32_t target_address;
	flash_err_t flash_err;

	while(load_firmware_control_block.status != FIRMWARE_UPDATE_STATE_ERASE_COMPLETE)
	{
		vTaskDelay(1);
	}

	while(1)
	{
		xQueueReceive(xQueue, &flash_block_for_queue, portMAX_DELAY);
		xSemaphoreTake(xSemaphore, portMAX_DELAY);
		memcpy(flash_block_array, flash_block_for_queue.binary, FLASH_CF_MIN_PGM_SIZE);
#if (BSP_MCU_RX65N) || (BSP_MCU_RX651)
		target_address = flash_block_for_queue.address - (uint32_t)0x00100000; /* minus 0x00100000 to switch the target address bank from 0xfff00000 to 0xffe00000 */
#else
#error "your MCU does not support Amazon FreeRTOS OTA feature."
#endif
		load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE;
		flash_err = R_FLASH_Write((uint32_t)flash_block_array, target_address, FLASH_CF_MIN_PGM_SIZE);
		flash_write111 += FLASH_CF_MIN_PGM_SIZE;
		if(flash_err != FLASH_SUCCESS)
		{
			nop();
		}
	}
}

static void ota_flashing_callback(void *event)
{
	uint32_t event_code;
	event_code = *((uint32_t*)event);

	static portBASE_TYPE xHigherPriorityTaskWoken;
	xSemaphoreGiveFromISR(xSemaphore, &xHigherPriorityTaskWoken);

    if(event_code == FLASH_INT_EVENT_WRITE_COMPLETE)
    {
		if(FIRMWARE_UPDATE_STATE_WRITE_WAIT_COMPLETE == load_firmware_control_block.status)
		{
			load_firmware_control_block.processed_byte += FLASH_CF_MIN_PGM_SIZE;
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_WRITE_COMPLETE;
    	}
		else if(FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_WRITE_DATA_FLASH == load_firmware_control_block.status)
		{
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_COMPLETED;
		}
    }
    else if(event_code == FLASH_INT_EVENT_ERASE_COMPLETE)
    {
		if(FIRMWARE_UPDATE_STATE_ERASE_WAIT_COMPLETE == load_firmware_control_block.status)
		{
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERASE_COMPLETE;
		}
		else if(FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_ERASE_DATA_FLASH == load_firmware_control_block.status)
		{
			R_FLASH_Write((uint32_t)&firmware_update_control_block_image, FLASH_DF_BLOCK_0, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK));
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_FINALIZE_WAIT_WRITE_DATA_FLASH;
		}
		else
		{
			load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
		}
    }
    else
    {
		load_firmware_control_block.status = FIRMWARE_UPDATE_STATE_ERROR;
    }
}
